Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.help.irohDiag
source: Usage: cmux iroh-diag Print the host's Iroh Connection Report as a plain-language timeline, the same data as Settings > Networking > Connection Report.
ar: الاستخدام: cmux iroh-diag اطبع تقرير اتصال Iroh للمضيف كمخطط زمني بلغة واضحة، وهي البيانات نفسها الموجودة في الإعدادات > الشبكات > تقرير الاتصال.
bs: Upotreba: cmux iroh-diag Ispiši izvještaj o Iroh vezi domaćina kao vremensku liniju razumljivim jezikom, iste podatke kao Postavke > Mreža > Izvještaj o vezi.
da: Brug: cmux iroh-diag Udskriv værtens Iroh-forbindelsesrapport som en tidslinje i almindeligt sprog, de samme data som Indstillinger > Netværk > Forbindelsesrapport.
de: Verwendung: cmux iroh-diag Gibt den Iroh-Verbindungsbericht des Hosts als verständliche Zeitleiste aus, dieselben Daten wie Einstellungen > Netzwerk > Verbindungsbericht.
es: Uso: cmux iroh-diag Muestra el informe de conexión Iroh del host como una cronología en lenguaje sencillo, los mismos datos que Ajustes > Red > Informe de conexión.
fr: Utilisation : cmux iroh-diag Affiche le rapport de connexion Iroh de l’hôte sous forme de chronologie en langage clair, les mêmes données que Réglages > Réseau > Rapport de connexion.
it: Uso: cmux iroh-diag Stampa il rapporto di connessione Iroh dell’host come cronologia in linguaggio semplice, gli stessi dati di Impostazioni > Rete > Rapporto di connessione.
ja: Usage: cmux iroh-diag ホストのIroh接続レポートを読みやすいタイムラインとして出力します。 設定 > ネットワーク > 接続レポートと同じデータです。
ko: 사용법: cmux iroh-diag 호스트의 Iroh 연결 보고서를 이해하기 쉬운 타임라인으로 출력합니다. 설정 > 네트워킹 > 연결 보고서와 동일한 데이터입니다.
nb: Bruk: cmux iroh-diag Skriv ut vertens Iroh-tilkoblingsrapport som en tidslinje i klart språk, de samme dataene som Innstillinger > Nettverk > Tilkoblingsrapport.
pl: Użycie: cmux iroh-diag Wyświetla raport połączenia Iroh hosta jako oś czasu napisaną prostym językiem, te same dane co Ustawienia > Sieć > Raport połączenia.
pt_br: Uso: cmux iroh-diag Exibe o relatório de conexão Iroh do host como uma linha do tempo em linguagem simples, os mesmos dados de Ajustes > Rede > Relatório de conexão.
ru: Использование: cmux iroh-diag Выводит отчет о подключении Iroh хоста в виде понятной временной шкалы, те же данные, что в Настройки > Сеть > Отчет о подключении.
th: การใช้งาน: cmux iroh-diag แสดงรายงานการเชื่อมต่อ Iroh ของโฮสต์เป็นไทม์ไลน์ที่อ่านเข้าใจง่าย เป็นข้อมูลเดียวกับ การตั้งค่า > เครือข่าย > รายงานการเชื่อมต่อ
tr: Kullanım: cmux iroh-diag Ana bilgisayarın Iroh Bağlantı Raporunu anlaşılır bir zaman çizelgesi olarak yazdırır, Ayarlar > Ağ > Bağlantı Raporu ile aynı verileri içerir.
uk: Використання: cmux iroh-diag Виводить звіт про підключення Iroh хоста як зрозумілу часову шкалу, ті самі дані, що в Налаштування > Мережа > Звіт про підключення.
zh_hans: 用法：cmux iroh-diag 以易读的时间线形式输出主机的 Iroh 连接报告， 数据与“设置 > 网络 > 连接报告”相同。
zh_hant: 用法：cmux iroh-diag 以易讀的時間軸形式輸出主機的 Iroh 連線報告， 資料與「設定 > 網路 > 連線報告」相同。

# cli.help.jumpToUnread
source: Usage: cmux jump-to-unread Focus the latest unread notification, matching the Notifications page action. Flags: --json Print JSON --id-format <mode> refs, uuids, or both
ar: الاستخدام: cmux jump-to-unread التركيز على أحدث إشعار غير مقروء، بمطابقة إجراء صفحة الإشعارات. الخيارات: --json طباعة بتنسيق JSON --id-format <mode> refs، أو uuids، أو كلاهما
de: Verwendung: cmux jump-to-unread Fokussiert die neueste ungelesene Benachrichtigung, entsprechend der Aktion auf der Benachrichtigungsseite. Flags: --json JSON ausgeben --id-format <mode> refs, uuids oder beides
es: Uso: cmux jump-to-unread Enfoca la última notificación no leída, coincidiendo con la acción de la página de Notificaciones. Opciones: --json Muestra JSON --id-format <mode> refs, uuids o ambos
fr: Utilisation : cmux jump-to-unread Cible la dernière notification non lue, correspondant à l'action de la page Notifications. Options : --json Affiche le JSON --id-format <mode> refs, uuids ou both
ja: Usage: cmux jump-to-unread 通知ページの操作と同じく、最新の未読通知へフォーカスします。 Flags: --json JSON を出力 --id-format <mode> refs、uuids、both のいずれか
ko: 사용법: cmux jump-to-unread 알림 페이지의 동작 방식과 동일하게 가장 최근 읽지 않은 알림에 포커스를 둡니다. 플래그: --json JSON 출력 --id-format <mode> refs, uuids 또는 둘 다
zh_hans: 用法：cmux jump-to-unread 聚焦最新的未读通知，与通知页面上的操作一致。 标志: --json 输出 JSON --id-format <mode> refs、uuids 或 both
zh_hant: 用法：cmux jump-to-unread 聚焦最新一則未讀通知，與「通知」頁面的操作相符。 旗標： --json 列印 JSON --id-format <mode> refs、uuids 或兩者皆是

# cli.help.markNotificationRead
source: Usage: cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) Mark notifications read without opening them. Exactly one selector is required. Flags: --id <uuid> Mark one notification read --workspace <id|ref> Mark notifications for a workspace --surface <id|ref> Narrow --workspace to one surface --all Mark every notification read --json Print JSON --id-format <mode> refs, uuids, or both
ar: الاستخدام: cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) تحديد الإشعارات كمقروءة دون فتحها. يجب تحديد محدد واحد بالضبط. الخيارات: --id <uuid> تحديد إشعار واحد كمقروء --workspace <id|ref> تحديد الإشعارات الخاصة بمساحة عمل كمقروءة --surface <id|ref> تضييق --workspace إلى سطح واحد --all تحديد كل الإشعارات كمقروءة --json طباعة بتنسيق JSON --id-format <mode> refs، أو uuids، أو كلاهما
de: Verwendung: cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) Markiert Benachrichtigungen als gelesen, ohne sie zu öffnen. Genau ein Selektor ist erforderlich. Flags: --id <uuid> Eine Benachrichtigung als gelesen markieren --workspace <id|ref> Benachrichtigungen für einen Arbeitsbereich markieren --surface <id|ref> Schränkt --workspace auf eine Oberfläche ein --all Alle Benachrichtigungen als gelesen markieren --json JSON ausgeben --id-format <mode> refs, uuids oder beides
es: Uso: cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) Marca las notificaciones como leídas sin abrirlas. Se requiere exactamente un selector. Opciones: --id <uuid> Marca una notificación como leída --workspace <id|ref> Marca las notificaciones de un espacio de trabajo --surface <id|ref> Limita --workspace a una superficie --all Marca todas las notificaciones como leídas --json Muestra JSON --id-format <mode> refs, uuids o ambos
fr: Utilisation : cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) Marque les notifications comme lues sans les ouvrir. Exactement un sélecteur est requis. Options : --id <uuid> Marque une notification comme lue --workspace <id|ref> Marque les notifications d’un espace de travail comme lues --surface <id|ref> Restreint --workspace à une seule surface d’affichage --all Marque toutes les notifications comme lues --json Affiche le JSON --id-format <mode> refs, uuids ou both
ja: Usage: cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) 通知を開かずに既読にします。セレクタは1つだけ指定してください。 Flags: --id <uuid> 通知を1件既読にする --workspace <id|ref> ワークスペースの通知を既読にする --surface <id|ref> --workspace を1つのサーフェスに絞り込む --all すべての通知を既読にする --json JSON を出力 --id-format <mode> refs、uuids、both のいずれか
ko: 사용법: cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) 알림을 열지 않고 읽음 상태로 표시합니다. 정확히 하나의 선택기가 필요합니다. 플래그: --id <uuid> 알림 하나를 읽음 표시 --workspace <id|ref> 특정 작업 공간의 알림 읽음 표시 --surface <id|ref> --workspace의 대상을 특정 화면으로 한정 --all 모든 알림을 읽음 표시 --json JSON 출력 --id-format <mode> refs, uuids 또는 둘 다
zh_hans: 用法：cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) 不打开通知即将其标记为已读。必须且只能指定一个选择器。 标志: --id <uuid> 将一条通知标记为已读 --workspace <id|ref> 标记某个工作区的通知 --surface <id|ref> 将 --workspace 缩小到某个表面 --all 将所有通知标记为已读 --json 输出 JSON --id-format <mode> refs、uuids 或 both
zh_hant: 用法：cmux mark-notification-read (--id <uuid> | --workspace <id|ref> [--surface <id|ref>] | --all) 將通知標記為已讀而無需開啟它們。需要正好一個選擇器。 旗標： --id <uuid> 將單一通知標記為已讀 --workspace <id|ref> 標記特定工作區的通知 --surface <id|ref> 將 --workspace 的範圍縮小至特定介面 --all 將所有通知標記為已讀 --json 列印 JSON --id-format <mode> refs、uuids 或兩者皆是

# cli.help.memory
source: Usage: cmux memory [flags] Diagnose cmux app memory separately from recursive terminal child-process RSS. Flags: --all Include all windows (default: current window only) --workspace <id|ref|index> Limit workspace context for attribution labels --groups <count> Number of child command groups to show (default: 12) --json Structured JSON output Output: App footprint is the direct cmux process physical footprint from macOS process accounting. Child RSS is recursive resident memory for descendants of the cmux app process, grouped by command name and attributed back to workspace, pane, and surface when known. Example: cmux memory cmux memory --groups 20 cmux --json memory --all
ar: الاستخدام: cmux memory [flags] يشخص ذاكرة تطبيق cmux بشكل منفصل عن RSS العودية لعمليات التيرمنال الفرعية. الخيارات: --all تضمين كل النوافذ (الافتراضي: النافذة الحالية فقط) --workspace <id|ref|index> تقييد سياق مساحة العمل لتسميات الإسناد --groups <count> عدد مجموعات أوامر العمليات الفرعية المراد عرضها (الافتراضي: 12) --json إخراج JSON منظم الإخراج: بصمة التطبيق هي البصمة الفيزيائية المباشرة لعملية cmux من محاسبة عمليات macOS. Child RSS هو الذاكرة المقيمة العودية لذرية عملية تطبيق cmux، مجموعة حسب اسم الأمر ومسنَدة إلى مساحة العمل والجزء والسطح عند معرفة ذلك. مثال: cmux memory cmux memory --groups 20 cmux --json memory --all
bs: Upotreba: cmux memory [flags] Dijagnosticira memoriju cmux aplikacije odvojeno od rekurzivnog RSS-a terminalskih podprocesa. Opcije: --all Uključi sve prozore (zadano: samo trenutni prozor) --workspace <id|ref|index> Ograniči kontekst radnog prostora za oznake pripisivanja --groups <count> Broj grupa naredbi podprocesa za prikaz (zadano: 12) --json Strukturirani JSON izlaz Izlaz: Otisak aplikacije je direktni fizički otisak cmux procesa iz macOS računanja procesa. Child RSS je rekurzivna rezidentna memorija potomaka cmux procesa, grupisana po nazivu naredbe i pripisana radnom prostoru, panelu i površini kada je poznato. Primjer: cmux memory cmux memory --groups 20 cmux --json memory --all
da: Brug: cmux memory [flags] Diagnosticerer cmux-appens hukommelse separat fra rekursiv RSS for terminalens underprocesser. Flag: --all Medtag alle vinduer (standard: kun aktuelt vindue) --workspace <id|ref|index> Begræns workspace-kontekst for tilskrivningsetiketter --groups <count> Antal underproces-kommandogrupper der vises (standard: 12) --json Struktureret JSON-output Output: Appens fodaftryk er cmux-processens direkte fysiske fodaftryk fra macOS procesregnskab. Child RSS er rekursiv resident hukommelse for efterkommere af cmux-app-processen, grupperet efter kommandonavn og tilskrevet workspace, rude og flade når det kendes. Eksempel: cmux memory cmux memory --groups 20 cmux --json memory --all
de: Verwendung: cmux memory [flags] Diagnostiziert den Speicher der cmux-App getrennt vom rekursiven RSS der Terminal-Kindprozesse. Optionen: --all Alle Fenster einbeziehen (Standard: nur aktuelles Fenster) --workspace <id|ref|index> Workspace-Kontext für Zuordnungslabels begrenzen --groups <count> Anzahl der anzuzeigenden Kindprozess-Befehlsgruppen (Standard: 12) --json Strukturierte JSON-Ausgabe Ausgabe: Der App-Footprint ist der direkte physische Footprint des cmux-Prozesses aus der macOS-Prozessabrechnung. Child RSS ist der rekursive residente Speicher der Nachkommen des cmux-App-Prozesses, gruppiert nach Befehlsname und bei bekannter Zuordnung Workspace, Bereich und Oberfläche zugewiesen. Beispiel: cmux memory cmux memory --groups 20 cmux --json memory --all
es: Uso: cmux memory [flags] Diagnostica la memoria de la app cmux por separado del RSS recursivo de procesos secundarios de terminal. Opciones: --all Incluir todas las ventanas (predeterminado: solo la ventana actual) --workspace <id|ref|index> Limitar el contexto del espacio de trabajo para las etiquetas de atribución --groups <count> Número de grupos de comandos secundarios que se mostrarán (predeterminado: 12) --json Salida JSON estructurada Salida: La huella de la app es la huella física directa del proceso cmux según la contabilidad de procesos de macOS. Child RSS es la memoria residente recursiva de los descendientes del proceso de la app cmux, agrupada por nombre de comando y atribuida al espacio de trabajo, panel y superficie cuando se conocen. Ejemplo: cmux memory cmux memory --groups 20 cmux --json memory --all
fr: Utilisation : cmux memory [flags] Diagnostique la mémoire de l’app cmux séparément du RSS récursif des processus enfants du terminal. Options: --all Inclure toutes les fenêtres (par défaut : fenêtre active uniquement) --workspace <id|ref|index> Limiter le contexte d’espace de travail pour les libellés d’attribution --groups <count> Nombre de groupes de commandes enfants à afficher (par défaut : 12) --json Sortie JSON structurée Sortie: L’empreinte de l’app est l’empreinte physique directe du processus cmux selon la comptabilité des processus macOS. Child RSS est la mémoire résidente récursive des descendants du processus de l’app cmux, regroupée par nom de commande et attribuée à l’espace de travail, au panneau et à la surface lorsque connus. Exemple: cmux memory cmux memory --groups 20 cmux --json memory --all
it: Uso: cmux memory [flags] Diagnostica la memoria dell’app cmux separatamente dall’RSS ricorsivo dei processi figli del terminale. Opzioni: --all Includi tutte le finestre (predefinito: solo finestra corrente) --workspace <id|ref|index> Limita il contesto dell’area di lavoro per le etichette di attribuzione --groups <count> Numero di gruppi di comandi figli da mostrare (predefinito: 12) --json Output JSON strutturato Output: L’impronta dell’app è l’impronta fisica diretta del processo cmux dalla contabilità dei processi di macOS. Child RSS è la memoria residente ricorsiva dei discendenti del processo dell’app cmux, raggruppata per nome comando e attribuita ad area di lavoro, pannello e superficie quando noti. Esempio: cmux memory cmux memory --groups 20 cmux --json memory --all
ja: Usage: cmux memory [flags] cmux アプリ本体のメモリと、ターミナル配下の再帰的な子プロセス RSS を分けて診断します。 Flags: --all すべてのウィンドウを含める（既定: 現在のウィンドウのみ） --workspace <id|ref|index> 帰属ラベルのワークスペース文脈を限定 --groups <count> 表示する子コマンドグループ数（既定: 12） --json 構造化 JSON を出力 Output: App footprint は macOS のプロセス会計による cmux プロセス本体の物理フットプリントです。 Child RSS は cmux アプリプロセスの子孫プロセスの再帰的な常駐メモリで、 コマンド名でグループ化し、分かる場合はワークスペース、ペイン、サーフェスへ帰属します。 Example: cmux memory cmux memory --groups 20 cmux --json memory --all
ko: 사용법: cmux memory [flags] cmux 앱 메모리를 터미널 하위 프로세스의 재귀 RSS와 분리해 진단합니다. 플래그: --all 모든 창 포함(기본값: 현재 창만) --workspace <id|ref|index> 귀속 레이블의 워크스페이스 컨텍스트 제한 --groups <count> 표시할 하위 명령 그룹 수(기본값: 12) --json 구조화된 JSON 출력 출력: 앱 footprint는 macOS 프로세스 회계의 cmux 프로세스 직접 물리 footprint입니다. Child RSS는 cmux 앱 프로세스 자손의 재귀 상주 메모리이며, 명령 이름으로 그룹화되고 확인 가능한 경우 워크스페이스, 패널, 서피스에 귀속됩니다. 예: cmux memory cmux memory --groups 20 cmux --json memory --all
nb: Bruk: cmux memory [flags] Diagnostiserer cmux-appens minne separat fra rekursiv RSS for terminalens underprosesser. Flagg: --all Ta med alle vinduer (standard: bare gjeldende vindu) --workspace <id|ref|index> Begrens arbeidsområdekontekst for tilordningsetiketter --groups <count> Antall underprosess-kommandogrupper som vises (standard: 12) --json Strukturert JSON-utdata Utdata: Appavtrykket er det direkte fysiske avtrykket til cmux-prosessen fra macOS prosessregnskap. Child RSS er rekursivt resident minne for etterkommere av cmux-app-prosessen, gruppert etter kommandonavn og tilordnet arbeidsområde, rute og flate når kjent. Eksempel: cmux memory cmux memory --groups 20 cmux --json memory --all
pl: Użycie: cmux memory [flags] Diagnozuje pamięć aplikacji cmux oddzielnie od rekurencyjnego RSS procesów potomnych terminala. Opcje: --all Uwzględnij wszystkie okna (domyślnie: tylko bieżące okno) --workspace <id|ref|index> Ogranicz kontekst obszaru roboczego dla etykiet przypisania --groups <count> Liczba grup poleceń procesów potomnych do pokazania (domyślnie: 12) --json Strukturalne wyjście JSON Wyjście: Ślad aplikacji to bezpośredni fizyczny ślad procesu cmux z rozliczania procesów macOS. Child RSS to rekurencyjna pamięć rezydentna potomków procesu aplikacji cmux, grupowana według nazwy polecenia i przypisywana do obszaru roboczego, panelu i powierzchni, gdy są znane. Przykład: cmux memory cmux memory --groups 20 cmux --json memory --all
pt_br: Uso: cmux memory [flags] Diagnostica a memória do app cmux separadamente do RSS recursivo dos processos filhos do terminal. Opções: --all Incluir todas as janelas (padrão: somente a janela atual) --workspace <id|ref|index> Limitar o contexto do workspace para rótulos de atribuição --groups <count> Número de grupos de comandos filhos a mostrar (padrão: 12) --json Saída JSON estruturada Saída: A pegada do app é a pegada física direta do processo cmux pela contabilidade de processos do macOS. Child RSS é a memória residente recursiva dos descendentes do processo do app cmux, agrupada por nome de comando e atribuída ao workspace, painel e superfície quando conhecidos. Exemplo: cmux memory cmux memory --groups 20 cmux --json memory --all
ru: Использование: cmux memory [flags] Диагностирует память приложения cmux отдельно от рекурсивного RSS дочерних процессов терминала. Флаги: --all Включить все окна (по умолчанию: только текущее окно) --workspace <id|ref|index> Ограничить контекст рабочей области для меток атрибуции --groups <count> Количество групп дочерних команд для показа (по умолчанию: 12) --json Структурированный вывод JSON Вывод: Отпечаток приложения — это прямой физический отпечаток процесса cmux по учету процессов macOS. Child RSS — это рекурсивная резидентная память потомков процесса приложения cmux, сгруппированная по имени команды и связанная с рабочей областью, панелью и поверхностью, если они известны. Пример: cmux memory cmux memory --groups 20 cmux --json memory --all
th: การใช้: cmux memory [flags] วินิจฉัยหน่วยความจำของแอป cmux แยกจาก RSS แบบเรียกซ้ำของโปรเซสลูกในเทอร์มินัล แฟล็ก: --all รวมหน้าต่างทั้งหมด (ค่าเริ่มต้น: เฉพาะหน้าต่างปัจจุบัน) --workspace <id|ref|index> จำกัดบริบทเวิร์กสเปซสำหรับป้ายกำกับการระบุที่มา --groups <count> จำนวนกลุ่มคำสั่งโปรเซสลูกที่จะแสดง (ค่าเริ่มต้น: 12) --json เอาต์พุต JSON แบบมีโครงสร้าง เอาต์พุต: footprint ของแอปคือ footprint ทางกายภาพโดยตรงของโปรเซส cmux จากการบัญชีโปรเซสของ macOS Child RSS คือหน่วยความจำ resident แบบเรียกซ้ำของโปรเซสสืบทอดจากโปรเซสแอป cmux, จัดกลุ่มตามชื่อคำสั่งและระบุที่มาไปยังเวิร์กสเปซ พาเนล และพื้นผิวเมื่อทราบ ตัวอย่าง: cmux memory cmux memory --groups 20 cmux --json memory --all
tr: Kullanım: cmux memory [flags] cmux uygulama belleğini terminal alt süreçlerinin özyinelemeli RSS değerinden ayrı tanılar. Bayraklar: --all Tüm pencereleri dahil et (varsayılan: yalnızca geçerli pencere) --workspace <id|ref|index> Atıf etiketleri için çalışma alanı bağlamını sınırla --groups <count> Gösterilecek alt komut grubu sayısı (varsayılan: 12) --json Yapılandırılmış JSON çıktısı Çıktı: Uygulama footprint değeri, macOS süreç muhasebesinden cmux sürecinin doğrudan fiziksel footprint değeridir. Child RSS, cmux uygulama sürecinin alt soylarının özyinelemeli yerleşik belleğidir, komut adına göre gruplanır ve bilindiğinde çalışma alanı, panel ve yüzeye atanır. Örnek: cmux memory cmux memory --groups 20 cmux --json memory --all
uk: Використання: cmux memory [flags] Діагностує пам’ять застосунку cmux окремо від рекурсивного RSS дочірніх процесів термінала. Прапорці: --all Включити всі вікна (типово: лише поточне вікно) --workspace <id|ref|index> Обмежити контекст робочої області для міток атрибуції --groups <count> Кількість груп дочірніх команд для показу (типово: 12) --json Структурований вивід JSON Вивід: Відбиток застосунку — це прямий фізичний відбиток процесу cmux за обліком процесів macOS. Child RSS — це рекурсивна резидентна пам’ять нащадків процесу застосунку cmux, згрупована за назвою команди й прив’язана до робочої області, панелі та поверхні, коли вони відомі. Приклад: cmux memory cmux memory --groups 20 cmux --json memory --all
zh_hans: 用法：cmux memory [flags] 将 cmux 应用内存与终端子进程的递归 RSS 分开诊断。 标志: --all 包含所有窗口（默认：仅当前窗口） --workspace <id|ref|index> 限制归因标签的工作区上下文 --groups <count> 要显示的子命令组数量（默认：12） --json 结构化 JSON 输出 输出: 应用 footprint 是 macOS 进程统计中 cmux 进程的直接物理 footprint。 Child RSS 是 cmux 应用进程后代的递归驻留内存， 按命令名分组，并在已知时归因到工作区、窗格和 surface。 示例: cmux memory cmux memory --groups 20 cmux --json memory --all
zh_hant: 用法：cmux memory [flags] 將 cmux 應用程式記憶體與終端機子行程的遞迴 RSS 分開診斷。 旗標: --all 包含所有視窗（預設：僅目前視窗） --workspace <id|ref|index> 限制歸因標籤的工作區情境 --groups <count> 要顯示的子命令群組數量（預設：12） --json 結構化 JSON 輸出 輸出: 應用程式 footprint 是 macOS 行程統計中 cmux 行程的直接實體 footprint。 Child RSS 是 cmux 應用程式行程後代的遞迴常駐記憶體， 依命令名稱分組，並在已知時歸因到工作區、窗格和 surface。 範例: cmux memory cmux memory --groups 20 cmux --json memory --all
